ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-McuLink-Pro/MCU-Link-Pro_Measurement/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief
 * Analog switch input control.
 * : For all pins except PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and PIO1_9 analog switch is
 * closed (enabled).
 */
#define PIO0_16_ASW_VALUE1 0x01u
/*!
 * @brief Select Digital mode.: Disable digital mode. Digital input set to 0. */
#define PIO0_16_DIGIMODE_ANALOG 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_16_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_16_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_17_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_17_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_24_FUNC_ALT1 0x01u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO0_24_MODE_PULL_DOWN 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_25_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_25_FUNC_ALT1 0x01u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO0_25_MODE_PULL_DOWN 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_29_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_29_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_6_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_6_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO0_6_MODE_PULL_DOWN 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_22_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_22_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_22_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_23_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_23_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_23_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_24_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_24_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_26_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_26_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_29_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_29_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_29_MODE_INACTIVE 0x00u

/*! @name PIO0_16 (number 14), curr_meas
  @{ */
#define BOARD_INITPINS_curr_meas_GPIO GPIO                 /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_curr_meas_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_curr_meas_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_curr_meas_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_22 (number 41), ctrl_cal_r1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_cal_r1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r1_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_cal_r1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r1_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_cal_r1_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_23 (number 42), ctrl_cal_r2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_cal_r2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_cal_r2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_cal_r2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_26 (number 68), ctrl_cal_r3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_cal_r3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r3_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_cal_r3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r3_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_cal_r3_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_29 (number 80), ctrl_cal_r4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_cal_r4_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r4_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_cal_r4_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_r4_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_cal_r4_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO1_24 (number 3), ctrl_cal_disc
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_cal_disc_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_disc_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_cal_disc_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_cal_disc_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_cal_disc_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO0_17 (number 8), ctrl_highcurr_en
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_highcurr_en_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_highcurr_en_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_highcurr_en_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_highcurr_en_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_highcurr_en_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_29 (number 92), ctrl_highcurr_dis
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ctrl_highcurr_dis_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ctrl_highcurr_dis_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ctrl_highcurr_dis_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ctrl_highcurr_dis_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ctrl_highcurr_dis_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_6 (number 89), p_trig
  @{ */
#define BOARD_INITPINS_p_trig_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_p_trig_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_p_trig_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_6 (number 89), p_trig
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_trig_gpio_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_trig_gpio_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_trig_gpio_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_trig_gpio_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_trig_gpio_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_24 (number 70), usart0_rx
  @{ */
#define BOARD_INITPINS_usart0_rx_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_usart0_rx_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_usart0_rx_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_25 (number 79), usart0_tx
  @{ */
#define BOARD_INITPINS_usart0_tx_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_usart0_tx_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_usart0_tx_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
